# імпорт модулів
import math

def trapezoid(a, b, c):
    # обчислення висоти
    h = math.sqrt(c**2 - ((b - a) / 2)**2)

    # Обчислення периметра
    P = a + b + 2 * c

    # Обчислення площі
    S = (a + b) / 2 * h
    return P, S, h

# Введення сторін трапеції
a = float(input("Введіть довжину верхньої основи a: "))
b = float(input("Введіть довжину нижньої основи b: "))
c = float(input("Введіть довжину бічної сторони c: "))

P, S, h = trapezoid(a, b, c)
print(f"\nПериметр трапеції: {P:.2f}")
print(f"Площа трапеції: {S:.2f}")
print(f"Висота трапеції: {h:.2f}")