import math

# Зчитування значення x для другої функції
x = float(input("Введіть значення 'x' для другої функції: "))

if x <= 0:
    print("Помилка: x повинно бути додатним.")
elif math.log(x) == 0:
    print("Помилка: ln(x) не повинен дорівнювати 0.")
else:
    # Обчислення першого члена
    term1 = (3 * x + math.sin(x)) / ((math.cos(x))**2 + x**2)

    # Обчислення другого члена
    term2 = (0.3 ** x) / math.log(x)

    # Обчислення значення функції
    y2 = term1 + term2
    print(f"Значення 'y' для другої функції = {y2:.2f}")
