routes = {
    "12": "Залізничний вокзал",
    "24": "Площа Перемоги",
    "7": "вул. Шевченка",
    "33": "Коледж",
    "18": "Автовокзал"
}

for k, v in routes.items():
    print(k, "-", v)

n = input("Введіть номер маршруту: ")
print(routes.get(n, "Такого маршруту немає"))

k = input("Введіть номер маршруту для зміни: ")
if k in routes:
    routes[k] = input("Введіть нову кінцеву: ")
    print("Змінено:", k, "-", routes[k])
else:
    print("Такого маршруту немає")

n2 = input("Введіть номер нового маршруту: ")
s2 = input("Введіть кінцеву зупинку: ")
routes[n2] = s2

print("Оновлені маршрути:")
for k, v in routes.items():
    print(k, "-", v)
