a = {"Вокзал", "Шевченка", "Парк", "Автовокзал"}
b = {"Парк", "Франка", "Ринок", "Аеропорт"}

print("Маршрут 1:", a)
print("Маршрут 2:", b)
print("Спільні:", a & b)
print("Тільки перший:", a - b)
print("Тільки другий:", b - a)
print("Всі разом:", a | b)
print("Тільки в одному:", a ^ b)

s = input("Введіть зупинку: ")
if s in a & b:
    print("Спільна зупинка")
elif s in a:
    print("Тільки перший маршрут")
elif s in b:
    print("Тільки другий маршрут")
else:
    print("Немає в жодному маршруті")
